-- -*- M2-comint -*- {* hash: -1010838168 *}
--loading configuration for package "PHCpack" from file /Users/dan/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)
... calling constructEmbedding ...
calling phc -c < /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/2PHCbatch > /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/3PHCsession
output of phc -c is in file /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/1PHCoutput
... calling solveSystem ...
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/4PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/4PHCoutput
... constructing a witness set ... 

o3 = ([dim=1,deg=3], {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.499057+.866569*ii)*zz1, x^3-z+(.880354+.474318*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(-.929785-.368102*ii)*x+(.619621-.784901*ii)*y+(.251682-.96781*ii)*z
     +(.288367-.95752*ii)*zz1+.471813-.881699*ii}

i8 : toString points(w)

o8 = VerticalList{{.405403+.934456*ii, -.708856+.757662*ii,
     -.995374-.355236*ii, -8.87795e-33+2.57938e-33*ii}, {-1.42537-.73304*ii,
     1.49432+2.0897*ii, -.598123-4.07399*ii, 2.89693e-32-1.7581e-32*ii},
     {.104382-.603546*ii, -.353372-.125998*ii, -.112931+.200124*ii,
     -5.57949e-33-5.32127e-33*ii}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);
... calling constructEmbedding ...
calling phc -c < /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/7PHCbatch > /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/8PHCsession
output of phc -c is in file /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/6PHCoutput
... calling solveSystem ...
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/9PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-44757-0/9PHCoutput
... constructing a witness set ... 

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
